Assuming one is running Guix as their operating system, then to update the contents of this folder run:

#+CAPTION: To update this repository by fetching the config files from appropriate locations
#+begin_src shell
make
#+end_src

#+CAPTION: To reconfigure the system with my custom packages
#+begin_src sh

# sudo guix system reconfigure -L ~/guix-config/nbl /etc/config.scm
sudo guix system reconfigure

#+end_src

** nix-env cheatsheet

#+begin_src shell :results output
curl cheat.sh/nix-env
#+end_src

#+RESULTS:
#+begin_example
# nix-env
# Manipulate or query Nix user environments.
# More information: <https://nixos.org/manual/nix/stable/#sec-nix-env>.

# List all installed packages:
nix-env -q

# Query installed packages:
nix-env -q search_term

# Query available packages:
nix-env -qa search_term

# Install package:
nix-env -iA nixpkgs.pkg_name

# Install a package from a URL:
nix-env -i pkg_name --file example.com

# Uninstall package:
nix-env -e pkg_name

# Upgrade one package:
nix-env -u pkg_name

# Upgrade all packages:
nix-env -u
#+end_example

